const Category_Ahkam = [
  {
    'id': 0,
    "name": "العقيدة",
    "brand": "Hawkers",
    "count": 25,
    "image": "ahkam1.png",
  },
  {
    'id': 1,
    "name": "العبادات",
    "brand": "Hawkers",
    "count": 22,
    "image": "ahkam1.png",
  },
  {
    'id': 2,
    "name": "المعاملات",
    "brand": "Mcdonald",
    "count": 14,
    "image": "ahkam1.png",
  },
  {
    'id': 3,
    "name": "فقة الأسرة",
    "brand": "Mcdonald",
    "count": 21,
    "image": "ahkam1.png",
  },
  {
    'id': 4,
    "name": "الحدود والقضاء",
    "brand": "Ben & Jerry's",
    "count": 11,
    "image": "ahkam1.png",
  },
  {
    'id': 5,
    "name": "الأيمان والنذور",
    "brand": "Hawkers",
    "count": 12,
    "image": "ahkam1.png",
  },
  {
    'id': 6,
    "name": "الأطعمة",
    "brand": "Dominos",
    "count": 4,
    "image": "ahkam1.png",
  },
  {
    'id': 7,
    "name": "الطب",
    "brand": "Hawkers",
    "count": 15,
    "image": "ahkam1.png",
  },
  {
    'id': 8,
    "name": "الحسبة والاحتساب",
    "brand": "Subway",
    "count": 16,
    "image": "ahkam1.png",
  },
  {
    'id': 9,
    "name": "الدعوة والدعاة \nوالعلماء",
    "brand": "Subway",
    "count": 16,
    "image": "ahkam1.png",
  }
];

const departments = [
  [
    'مراتب الدين',
    'التوحيد وأقسامه',
    'توحيد الربوبية',
    'توحيد الأسماء والصفات',
    'الشرك وانواعه',
    'نواقض الإسلام',
    'الإيمان بالكتب',
    'الإمان بالملائكة',
    'الإيمان بالرسل',
    'الإيمان بالقضاء والقدر',
    'الإيمان بالرسل',
    'الإيمان باليوم الآخر',
    'الولاء والبراء',
    'الخوف والرجاء',
    'الجن والشياطين',
    'البدع والمحدثات',
  ],
  [
    'كتاب الطهارة',
    'كتاب الصلاة',
    'كتاب الزكاة',
    'كتاب الصيام',
    'كتاب المناسك',
    'كتاب الجهاد',
  ],
  [
    'كتاب البيوع',
    'كتاب الوصايا',
    'كتاب الفرائض',
  ],
  [
    'الخطبة',
    'النكاح الشرعي وفوائده',
    'الأنكحة المحرمة',
    'شروط في النكاح',
    'الصداق',
    'عشرة النساء',
    'الخلع',
    'الطلاق',
  ]
];

List<Map<String, Object>> posts = [
  {
    "_id": "1",
    "title": 'a',
    "en-title": 'a',
    "quz":
        "كثيرًا ما أرى الجرائد الإسلامية في سوريا ومصر تنشر أخبارًا عن أحوال (البورصة) وتقلباتها في صعود وهبوط، فهل ذلك محرم شرعًا أم لا؟ أرجو إفادتنا في المنار الأغر جزاكم الله عن الإسلام خيرًا.",
    "ar-text":
        "القاعدة في معرفة المحرم الذي لم ينطق الشارع بتحريمه: أن كل ضارّ محرم، فإذا كان خبر البورصة ينشر بإيعاز من المتلاعبين فيها لأجل غش الناس وحملهم على بيع ما عندهم من العروض والحاصلات كالقطن وغيره توهمًا أن المبادرة إلى البيع خير لهم، والحقيقة غير ذلك، فلا شك أن نشره محرم، وكثيرًا ما يحصل هذا كما يحصل ضده، وهو إيقاف الناس على ما يجري هناك من المساومات والعقود ليكونوا على بصيرة من أمرهم، والأمور بمقاصدها. ولا يقال: إن أعمال البورصة وعقودها مخالفة للشرع؛ فالإخبار بها محرم على كل حال. إذ العلم ببعض المخالفات والمحرمات ينفع أحيانًا كما إذا تواطأ قوم على السرقة في بعض الأمكنة، فإعلام الناس بخبرهم ينبههم إلى توقي شرهم.",
    "en-quz": "",
    "en-text": "",
    'source':
        "فتاوى الشيخ محمد رشيد رضا رقم الفتوى: 114 تاريخ النشر في الموقع : 03/12/2017",
    'creatorName': "khaled",
    'category': "المعامــــلات",
    'department': "المعامــــلات",
    'date': "03/12/2017",
    'description': "الجرائد الإسلامية والبورصة",
    'deviceNo': "a",
    'views': 0,
  },
  {
    "_id": "1",
    "title": 'b',
    "quz":
        "كثيرًا ما أرى الجرائد الإسلامية في سوريا ومصر تنشر أخبارًا عن أحوال (البورصة) وتقلباتها في صعود وهبوط، فهل ذلك محرم شرعًا أم لا؟ أرجو إفادتنا في المنار الأغر جزاكم الله عن الإسلام خيرًا.",
    "text":
        "القاعدة في معرفة المحرم الذي لم ينطق الشارع بتحريمه: أن كل ضارّ محرم، فإذا كان خبر البورصة ينشر بإيعاز من المتلاعبين فيها لأجل غش الناس وحملهم على بيع ما عندهم من العروض والحاصلات كالقطن وغيره توهمًا أن المبادرة إلى البيع خير لهم، والحقيقة غير ذلك، فلا شك أن نشره محرم، وكثيرًا ما يحصل هذا كما يحصل ضده، وهو إيقاف الناس على ما يجري هناك من المساومات والعقود ليكونوا على بصيرة من أمرهم، والأمور بمقاصدها. ولا يقال: إن أعمال البورصة وعقودها مخالفة للشرع؛ فالإخبار بها محرم على كل حال. إذ العلم ببعض المخالفات والمحرمات ينفع أحيانًا كما إذا تواطأ قوم على السرقة في بعض الأمكنة، فإعلام الناس بخبرهم ينبههم إلى توقي شرهم.",
    "en-text": "",
    'source':
        "فتاوى الشيخ محمد رشيد رضا رقم الفتوى: 114 تاريخ النشر في الموقع : 03/12/2017",
    'creatorName': "khaled",
    'category': "المعامــــلات",
    'department': "المعامــــلات",
    'time': "03/12/2017",
    'description': "الجرائد الإسلامية والبورصة",
    'deviceNo': "a",
    'views': 0,
  },
  {
    "_id": "1",
    "title": 'c',
    "quz":
        "كثيرًا ما أرى الجرائد الإسلامية في سوريا ومصر تنشر أخبارًا عن أحوال (البورصة) وتقلباتها في صعود وهبوط، فهل ذلك محرم شرعًا أم لا؟ أرجو إفادتنا في المنار الأغر جزاكم الله عن الإسلام خيرًا.",
    "text":
        "القاعدة في معرفة المحرم الذي لم ينطق الشارع بتحريمه: أن كل ضارّ محرم، فإذا كان خبر البورصة ينشر بإيعاز من المتلاعبين فيها لأجل غش الناس وحملهم على بيع ما عندهم من العروض والحاصلات كالقطن وغيره توهمًا أن المبادرة إلى البيع خير لهم، والحقيقة غير ذلك، فلا شك أن نشره محرم، وكثيرًا ما يحصل هذا كما يحصل ضده، وهو إيقاف الناس على ما يجري هناك من المساومات والعقود ليكونوا على بصيرة من أمرهم، والأمور بمقاصدها. ولا يقال: إن أعمال البورصة وعقودها مخالفة للشرع؛ فالإخبار بها محرم على كل حال. إذ العلم ببعض المخالفات والمحرمات ينفع أحيانًا كما إذا تواطأ قوم على السرقة في بعض الأمكنة، فإعلام الناس بخبرهم ينبههم إلى توقي شرهم.",
    "en-text": "",
    'source':
        "فتاوى الشيخ محمد رشيد رضا رقم الفتوى: 114 تاريخ النشر في الموقع : 03/12/2017",
    'creatorName': "khaled",
    'category': "المعامــــلات",
    'department': "المعامــــلات",
    'time': "03/12/2017",
    'description': "الجرائد الإسلامية والبورصة",
    'deviceNo': "a",
    'views': 0,
  },
];
